<?php

$translation_table = array (
	'required_field'			=> 'Поле обязательно для заполнения.',
	'too_short'					=> 'Поле должно содержать более чем $minlength символов.',
	'too_long'					=> 'Поле должно содержать менее $maxlength символов.',
	'alpha_only'				=> 'Поле содержит неверные символы (допустимы только буквенные символы "a-z, A-Z, а-я, А-Я").',
	'numeric_only'				=> 'Поле содержит неверные символы (допустимы только цифровые символы "0-9").',
	'alphanum_only'				=> 'Поле содержит неверные символы (допустимы только буквенные и цифровые символы \"a-z, A-Z, а-я, А-Я, 0-9\").',	
	'dateTimeOnly'				=> 'Неверный формат даты (ДД.ММ.ГГГГ ЧЧ:МинМин)',
	'fullDateTimeOnly'			=> 'Неверный формат даты (ДД.ММ.ГГГГ ЧЧ:МинМин:СекСек)',
	'fullDateOnly'				=> 'Неверный формат даты (ДД.ММ.ГГГГ)',
	'dateOnly'					=> 'Неверный формат даты (ДД.ММ.ГГ)',
	'invalid_email'				=> 'Неверный e-mail.',
	'invalid_ip'				=> 'Неверный IP адрес.',
	'invalid_selection'			=> 'Поле выбрано неверно.',
	'too_many_selections'		=> 'Выбранно слишком много выриантов.',
	'passwords_do_not_match'	=> 'Пароли не совпадают.',
	'file_too_small'			=> 'Слишком маленький размер файла ($name) (\"$size\").',
	'file_too_big'				=> 'Слишком большой размер файла ($name) (\"$size\").',
	'file_invalid_extension'	=> 'Неподдерживаемый формат файла ($name) (\"$extension\").',
	'file_denied_extension'		=> 'Запрещенный формат файла ($name) (\"$extension\").',
	'file_invalid_type'			=> 'Неподдерживаемый тип файла ($name) (\"$type\").',
	'file_denied_type'			=> 'Запрещенный тип файла ($name) (\"$type\").',
	'file_must_upload'			=> 'Вы должны загрузить верный файл.',
	'file_exists'				=> 'Файл с таким именем уже существует! Попробуйте переименовать файл и повторить попытку.',
	'file_attack'				=> 'Обнаружена попытка атаки! Файл не загружен.',
	'file_wrong_destination'	=> 'Директория для загрузки файла не найдена (\"$destination\")',
);

	



/*

$translation_table = array (
	"required_field"			=> "Поле обязательно для заполнения.",
	"too_short"					=> "Поле должно содержать более чем $minlength символов.",
	"too_long"					=> "Поле должно содержать менее $maxlength символов.",
	"alpha_only"				=> "Поле содержит неверные символы (допустимы только буквенные символы \"a-z, A-Z, а-я, А-Я\").",
	"numeric_only"				=> "Поле содержит неверные символы (допустимы только цифровые символы \"0-9\").",
	"alphanum_only"				=> "Поле содержит неверные символы (допустимы только буквенные и цифровые символы \"a-z, A-Z, а-я, А-Я, 0-9\").",
	"invalid_email"				=> "Неверный e-mail.",
	"invalid_ip"				=> "Неверный IP адрес.",
	"invalid_selection"			=> "Поле выбрано неверно.",
	"too_many_selections"		=> "Выбранно слишком много выриантов.",
	"passwords_do_not_match"	=> "Пароли не совпадают.",
	"file_too_small"			=> "Слишком маленький размер файла ($name).",
	"file_too_big"				=> "Слишком большой размер файла ($name).",
	"file_invalid_extension"	=> "Неподдерживаемый формат файла ($name) (\"$extension\").",
	"file_invalid_type"			=> "Неподдерживаемый формат файла ($name) (\"$type\").",
	"file_must_upload"			=> "Вы должны загрузить верный файл.",
);

*/



?>
