<?php
//
//require_once "includes/class.MailSend.php";
//
//$text = "<b>Здравствуйте, Юлия Викторовна!</b>";
//
//$text .= "<br>";
//$text .= "<br>";
//
//$text .= "Какая конкретно ошибка при загрузке файла? Проверьте, чтобы файл был формата PDF. При загрузке нового файла, старый автоматически удаляется и заменяется новым.";
//
//$text .= "<br>";
//$text .= "<br>";
//
//$text .= "Не отвечайте на это письмо. Для повторного обращения, воспользуйтесь формой на сайте.";
//
//$text .= "<br>";
//$text .= "<br>";
//
//$text .= "С уважением,<br>";
//$text .= "ИМЭМО РАН.";
//
//MailSend::send_mime_mail("Техническая поддержка аспирантуры ИМЭМО РАН", "asp_tech_support@imemo.ru", "", "juliyadudnik@mail.ru", "cp1251", "utf-8", "Техническая поддержка аспирантуры ИМЭМО РАН", $text);
//
////phpinfo();